apache/nuttx/arch/arm/src/common/stm32/stm32_adc_m0_v1.c
/****************************************************************************
 * arch/arm/src/common/stm32/stm32_adc_m0_v1.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdio.h>
#include <sys/types.h>
#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <unistd.h>
#include <string.h>
#include <errno.h>
#include <assert.h>
#include <nuttx/debug.h>
#include <unistd.h>

#include <arch/board/board.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/analog/adc.h>
#include <nuttx/analog/ioctl.h>
#include <nuttx/mutex.h>

#include "arm_internal.h"
#include "chip.h"
#include "stm32.h"
#include "stm32_tim.h"
#include "stm32_dma.h"
#include "stm32_adc.h"

/* STM32 ADC "lower-half" support must be enabled */

#ifdef CONFIG_STM32_ADC

/* Some ADC peripheral must be enabled */

#if defined(CONFIG_STM32_ADC1)

#if defined(CONFIG_STM32_STM32F0)
#  error Not tested
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* RCC reset ****************************************************************/

#define STM32_RCC_RSTR      STM32_RCC_APB2RSTR
#define RCC_RSTR_ADC1RST    RCC_APB2RSTR_ADC1RST

/* ADC Channels/DMA *********************************************************/

/* DMA values differs according to STM32 DMA IP core version */

#if  defined(HAVE_IP_DMA_V1)
#  define ADC_DMA_CONTROL_WORD (DMA_CCR_MSIZE_16BITS | \
                                DMA_CCR_PSIZE_16BITS | \
                                DMA_CCR_MINC | \
                                DMA_CCR_CIRC)
#else
#  error Not supported
#endif

/* Sample time default configuration */

/* C0, G0 and U0 support additional sample time selection 2 */

#if defined(CONFIG_STM32_STM32G0) || defined(CONFIG_STM32_STM32C0) || \
    defined(CONFIG_STM32_STM32U0)
#  define ADC_HAVE_SMPR_SMP2
#endif

#if defined(ADC_HAVE_DMA) || (CONFIG_STM32_ADC_MAX_SAMPLES == 1)
#  if defined(CONFIG_ARCH_CHIP_STM32C0) || defined(CONFIG_ARCH_CHIP_STM32G0) || \
      defined(CONFIG_ARCH_CHIP_STM32U0)
#    define ADC_SMP1_DEFAULT  ADC_SMPR_12p5
#    define ADC_SMP2_DEFAULT  ADC_SMPR_12p5
#  else
#    define ADC_SMP1_DEFAULT  ADC_SMPR_13p5
#  endif
#else /* Slow down sampling frequency */
#  if defined(CONFIG_ARCH_CHIP_STM32C0) || defined(CONFIG_ARCH_CHIP_STM32G0) || \
      defined(CONFIG_ARCH_CHIP_STM32U0)
#    define ADC_SMP1_DEFAULT  ADC_SMPR_160p5
#    define ADC_SMP2_DEFAULT  ADC_SMPR_160p5
#  else
#    define ADC_SMP1_DEFAULT  ADC_SMPR_239p5
#  endif
#endif

#ifdef ADC_HAVE_SMPR_SMP2
#  define ADC_SMPSEL_DEFAULT  0 /* For now we use only SMP1 */
#endif

/* Number of channels per ADC:
 *   - F0, L0, G0 - 19, but single SMP for all channels
 *
 * NOTE: this value can be obtained from SMPRx register description
 *       (ST manual)
 */

#if defined(CONFIG_STM32_STM32F0) || \
    defined(CONFIG_STM32_STM32L0) || \
    defined(CONFIG_STM32_STM32C0) || \
    defined(CONFIG_STM32_STM32G0) || \
    defined(CONFIG_STM32_STM32U0)
#  define ADC_CHANNELS_NUMBER 19
#else
#  error "Not supported"
#endif

/* ADC resolution */

#define HAVE_ADC_RESOLUTION

/* ADC have common registers but only single ADC */

#define HAVE_ADC_CMN_REGS 1

/* ADCx_EXTSEL_VALUE */

#ifdef ADC1_EXTSEL_VALUE
#  define ADC1_HAVE_EXTCFG  1
#  define ADC1_EXTCFG_VALUE (ADC1_EXTSEL_VALUE | ADC_EXTREG_EXTEN_DEFAULT)
#else
#  undef ADC1_HAVE_EXTCFG
#endif

#if defined(ADC1_HAVE_EXTCFG)
#  define ADC_HAVE_EXTCFG
#endif

/* ADC DMA configuration bit support */

#define ADC_HAVE_DMACFG 1

#if defined(CONFIG_STM32_STM32G0) || defined(CONFIG_STM32_STM32L0) || \
    defined(CONFIG_STM32_STM32U0)
#  ifndef ANIOC_SET_OVERSAMPLE
#    define ANIOC_SET_OVERSAMPLE _ANIOC(0x0f)
#  endif
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Data common to all ADC instances */

#ifdef HAVE_ADC_CMN_DATA
struct adccmn_data_s
{
  uint8_t initialized; /* How many ADC instances are currently in use */
  mutex_t lock;        /* Exclusive access to common ADC data */
};
#endif

/* This structure describes the state of one ADC block
 * REVISIT: save some space with bit fields.
 */

struct stm32_dev_s
{
#ifdef CONFIG_STM32_ADC_LL_OPS
  const struct stm32_adc_ops_s *llops; /* Low-level ADC ops */
#endif
#if !defined(CONFIG_STM32_ADC_NOIRQ) | defined(ADC_HAVE_DMA)
  const struct adc_callback_s *cb;
  uint8_t irq;               /* Interrupt generated by this ADC block */
#endif
#ifdef HAVE_ADC_CMN_DATA
  struct adccmn_data_s *cmn; /* Common ADC data */
#endif
  uint8_t rnchannels;        /* Number of regular channels */
  uint8_t cr_channels;       /* Number of configured regular channels */
  uint8_t intf;              /* ADC interface number */
  uint8_t current;           /* Current ADC channel being converted */
#ifdef HAVE_ADC_RESOLUTION
  uint8_t resolution;        /* ADC resolution (0-3) */
#endif
#ifdef ADC_HAVE_DMA
  uint8_t dmachan;           /* DMA channel needed by this ADC */
#  ifdef ADC_HAVE_DMACFG
  uint8_t dmacfg;            /* DMA channel configuration, only for ADC IPv2 */
#  endif
  bool    hasdma;            /* True: This channel supports DMA */
  uint16_t dmabatch;         /* Number of conversions for DMA batch */
#endif
#ifdef CONFIG_STM32_ADC_CHANGE_SAMPLETIME
  /* Sample time selection. These bits must be written only when ADON=0. */

#  ifdef ADC_HAVE_SMPR_SMP2
  uint8_t sample_rate[2];    /* [0] for SMP1, [1] for SMP2 */
  uint32_t smpsel;           /* ADC Sample Rate Selection Bits */
#  else
  uint8_t sample_rate[1];    /* Only SMP1 is used */
#  endif
#endif
#ifdef ADC_HAVE_TIMER
  uint8_t trigger;           /* Timer trigger channel: 0=CC1, 1=CC2, 2=CC3,
                              * 3=CC4, 4=TRGO, 5=TRGO2
                              */
#endif
  xcpt_t   isr;              /* Interrupt handler for this ADC block */
  uint32_t base;             /* Base address of registers unique to this ADC
                              * block */
#ifdef ADC_HAVE_EXTCFG
  uint32_t extcfg;           /* External event configuration for regular group */
#endif
#ifdef ADC_HAVE_TIMER
  uint32_t tbase;            /* Base address of timer used by this ADC block */
  uint32_t pclck;            /* The PCLK frequency that drives this timer */
  uint32_t freq;             /* The desired frequency of conversions */
#endif
#ifdef ADC_HAVE_DMA
  DMA_HANDLE dma;            /* Allocated DMA channel */

  /* DMA transfer buffer */

