apache/nuttx/arch/arm/src/common/stm32/stm32_adc_m0_v1.c
      /* Disable the ADC */

      adc_putreg(priv, STM32_ADC_CR_OFFSET, regval | ADC_CR_ADDIS);

      /* Wait for the ADC to be disabled */

      while ((adc_getreg(priv, STM32_ADC_CR_OFFSET) & ADC_CR_ADEN) != 0);
    }
}

/****************************************************************************
 * Name: adc_dmaconvcallback
 *
 * Description:
 *   Callback for DMA.  Called from the DMA transfer complete interrupt after
 *   all channels have been converted and transferred with DMA.
 *
 * Input Parameters:
 *
 *   handle - handle to DMA
 *   isr -
 *   arg - adc device
 *
 * Returned Value:
 *
 ****************************************************************************/

#if defined(ADC_HAVE_DMA)
static void adc_dmaconvcallback(DMA_HANDLE handle, uint8_t isr,
                                void *arg)
{
  struct adc_dev_s   *dev  = (struct adc_dev_s *)arg;
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev->ad_priv;
  int i;

  /* Verify that the upper-half driver has bound its callback functions */

  if (priv->cb != NULL)
    {
      DEBUGASSERT(priv->cb->au_receive != NULL);

      for (i = 0; i < priv->rnchannels * priv->dmabatch; i++)
        {
          priv->cb->au_receive(dev, priv->r_chanlist[priv->current],
                               priv->r_dmabuffer[i]);
          priv->current++;
          if (priv->current >= priv->rnchannels)
            {
              /* Restart the conversion sequence from the beginning */

              priv->current = 0;
            }
        }
    }

  /* Restart DMA for the next conversion series */

  adc_modifyreg(priv, STM32_ADC_DMAREG_OFFSET, ADC_DMAREG_DMA, 0);
  adc_modifyreg(priv, STM32_ADC_DMAREG_OFFSET, 0, ADC_DMAREG_DMA);
}
#endif

/****************************************************************************
 * Name: adc_bind
 *
 * Description:
 *   Bind the upper-half driver callbacks to the lower-half implementation.
 *   This must be called early in order to receive ADC event notifications.
 *
 ****************************************************************************/

static int adc_bind(struct adc_dev_s *dev,
                    const struct adc_callback_s *callback)
{
#ifndef CONFIG_STM32_ADC_NOIRQ
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev->ad_priv;

  DEBUGASSERT(priv != NULL);
  priv->cb = callback;
#endif

  return OK;
}

/****************************************************************************
 * Name: adc_watchdog_cfg
 ****************************************************************************/

static void adc_watchdog_cfg(struct stm32_dev_s *priv)
{
  uint32_t clrbits = 0;
  uint32_t setbits = 0;

  uint32_t th = 0;

  /* Initialize the watchdog high threshold register */

  th |= 0x0fff << ADC_TR_HT_SHIFT;

  /* Initialize the watchdog low threshold register */

  th |= 0x0000 << ADC_TR_LT_SHIFT;

  /* Write threshold register */

  adc_putreg(priv, STM32_ADC_TR_OFFSET, th);

  clrbits = ADC_CFGR1_AWDCH_MASK;
  setbits = ADC_CFGR1_AWDEN | (priv->r_chanlist[0] << ADC_CFGR1_AWDCH_SHIFT);

  /* Modify CFGR1 configuration */

  adc_modifyreg(priv, STM32_ADC_CFGR1_OFFSET, clrbits, setbits);
}

/****************************************************************************
 * Name: adc_calibrate
 ****************************************************************************/

static void adc_calibrate(struct stm32_dev_s *priv)
{
  /* Calibrate the ADC.
   *   1. ADC must be disabled
   *   2. the voltage regulator must be enabled
   */

  adc_modifyreg(priv, STM32_ADC_CR_OFFSET, 0, ADC_CR_ADCAL);

  /* Wait for the calibration to complete */

  while ((adc_getreg(priv, STM32_ADC_CR_OFFSET) & ADC_CR_ADCAL) != 0);
}

/****************************************************************************
 * Name: adc_mode_cfg
 ****************************************************************************/

static void adc_mode_cfg(struct stm32_dev_s *priv)
{
  uint32_t clrbits = 0;
  uint32_t setbits = 0;

  /* Disable continuous mode and set align to right */

  clrbits = ADC_CFGR1_CONT | ADC_CFGR1_ALIGN;

  /* Disable external trigger for regular channels */

  clrbits |= ADC_CFGR1_EXTEN_MASK;
  setbits |= ADC_CFGR1_EXTEN_NONE;

#ifdef CONFIG_STM32_ADC1_CONTINUOUS
  setbits |= ADC_CFGR1_CONT;
#endif

  /* Set CFGR configuration */

  adc_modifyreg(priv, STM32_ADC_CFGR1_OFFSET, clrbits, setbits);
}

/****************************************************************************
 * Name: adc_voltreg_cfg
 ****************************************************************************/

static void adc_voltreg_cfg(struct stm32_dev_s *priv)
{
  /* Enable voltage regulator - required by ADC calibration */

  adc_putreg(priv, STM32_ADC_CR_OFFSET, ADC_CR_ADVREGEN);

  /* Wait for ADC voltage regulator start-up */

  up_udelay(50);
}

/****************************************************************************
 * Name: adc_sampletime_cfg
 ****************************************************************************/

static void adc_sampletime_cfg(struct adc_dev_s *dev)
{
  /* Initialize the same sample time for each ADC.
   * During sample cycles channel selection bits must remain unchanged.
   */
#ifdef CONFIG_STM32_ADC_CHANGE_SAMPLETIME
  struct adc_sample_time_s time_samples = {
#  ifdef STM32_ADC1_SMPR_SMP1
      .smp1    = STM32_ADC1_SMPR_SMP1,
#  else
      .smp1    = ADC_SMP1_DEFAULT,
#  endif

#  ifdef ADC_HAVE_SMPR_SMP2
#    ifdef STM32_ADC1_SMPR_SMP2
      .smp2    = STM32_ADC1_SMPR_SMP2,
#    else
      .smp2    = ADC_SMP2_DEFAULT,
#    endif

#    ifdef STM32_ADC1_SMPR_SMPSEL
      .smpsel  = STM32_ADC1_SMPR_SMPSEL
#    else
      .smpsel  = ADC_SMPSEL_DEFAULT
#    endif
#  else
      .smp2    = 0,
      .smpsel  = 0
#  endif
  };

  adc_sampletime_set((struct stm32_adc_dev_s *)dev, &time_samples);
  adc_sampletime_write((struct stm32_adc_dev_s *)dev);
#else
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev->ad_priv;
  uint32_t setbits = 0;

  /* Configure sample time 1 */

  setbits |= ADC_SMP1_DEFAULT << ADC_SMPR_SMP1_SHIFT;

#ifdef ADC_HAVE_SMPR_SMP2
  /* Configure sample time 2 */

  setbits |= ADC_SMP2_DEFAULT << ADC_SMPR_SMP2_SHIFT;

  /* Configure sample time selection */

